/* 
 * File:   hidmedia.c
 * Author: mark
 *
 * Created on May 1, 2013, 9:20 PM
 *
 * This code is derived from Microchip USB HID Keyboard example code,
 * customised and refactored to work as the MWJ Media Keyboard.
 *
 * Copyright (C) 2013 Mark Webb-Johnson
 * Portions probably copyright Microchip Technology Inc.
 *
 * THIS SOFTWARE IS PROVIDED IN AN "AS IS" CONDITION. NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
 * TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 * PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. THE COMPANY SHALL NOT,
 * IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL OR
 * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 */

#ifndef KEYBOARD_C
#define KEYBOARD_C

/** INCLUDES *******************************************************/
#include "usb_config.h"
#include "./USB/usb.h"
#include "HardwareProfile.h"
#include "./USB/usb_function_hid.h"

/** CONFIGURATION **************************************************/

// PIC18F4550/PIC18F2550 configuration for the MWJ Media Controller
#pragma config PLLDIV   = 5         // 20Mhz external oscillator
#pragma config CPUDIV   = OSC1_PLL2
#pragma config USBDIV   = 2         // Clock source from 96MHz PLL/2
#pragma config FOSC     = HSPLL_HS
#pragma config FCMEN    = OFF
#pragma config IESO     = OFF
#pragma config PWRT     = OFF
#pragma config BOR      = ON
#pragma config BORV     = 3
#pragma config VREGEN   = ON
#pragma config WDT      = OFF
#pragma config WDTPS    = 32768
#pragma config MCLRE    = ON
#pragma config LPT1OSC  = OFF
#pragma config PBADEN   = OFF
// #pragma config CCP2MX   = ON
#pragma config STVREN   = ON
#pragma config LVP      = OFF
// #pragma config ICPRT    = OFF
#pragma config XINST    = OFF
#pragma config CP0      = OFF
#pragma config CP1      = OFF
// #pragma config CP2      = OFF
// #pragma config CP3      = OFF
#pragma config CPB      = OFF
// #pragma config CPD      = OFF
#pragma config WRT0     = OFF
#pragma config WRT1     = OFF
// #pragma config WRT2     = OFF
// #pragma config WRT3     = OFF
#pragma config WRTB     = OFF
#pragma config WRTC     = OFF
// #pragma config WRTD     = OFF
#pragma config EBTR0    = OFF
#pragma config EBTR1    = OFF
// #pragma config EBTR2    = OFF
// #pragma config EBTR3    = OFF
#pragma config EBTRB    = OFF

/** VARIABLES ******************************************************/
//The ReceivedDataBuffer[] and ToSendDataBuffer[] arrays are used as
//USB packet buffers in this firmware.  Therefore, they must be located in
//a USB module accessible portion of microcontroller RAM.
#pragma udata USB_VARIABLES=0x500
#define IN_DATA_BUFFER_ADDRESS_TAG
#define OUT_DATA_BUFFER_ADDRESS_TAG

unsigned char hid_report_in[HID_INT_IN_EP_SIZE] IN_DATA_BUFFER_ADDRESS_TAG;
volatile unsigned char hid_report_out[HID_INT_OUT_EP_SIZE] OUT_DATA_BUFFER_ADDRESS_TAG;

#pragma udata
USB_HANDLE lastINTransmission;
USB_HANDLE lastOUTTransmission;

unsigned long keypresses_counter;
BYTE keypresses,keypresses_spending,keypresses_lpending,keypresses_store;
typedef struct {
  unsigned dpadDown:1;          // 0x01
  unsigned dpadLeft:1;          // 0x02
  unsigned dpadEnter:1;         // 0x04
  unsigned dpadRight:1;         // 0x08
  unsigned topRight:1;          // 0x10
  unsigned dpadUp:1;            // 0x20
  unsigned topLeft:1;           // 0x40
  unsigned mode:1;              // 0x80
} keypresses_t;
#define keypressBits (*((keypresses_t*)&keypresses))
#define keypressShortPendingBits (*((keypresses_t*)&keypresses_spending))
#define keypressLongPendingBits (*((keypresses_t*)&keypresses_lpending))

BYTE mode;
BYTE idler;

/** PRIVATE PROTOTYPES *********************************************/
BOOL modeIsPressed(void);
BOOL dpadUpIsPressed(void);
BOOL dpadDownIsPressed(void);
BOOL dpadLeftIsPressed(void);
BOOL dpadRightIsPressed(void);
BOOL dpadEnterIsPressed(void);
BOOL topLeftIsPressed(void);
BOOL topRightIsPressed(void);
BOOL modeLongPressed(void);
BOOL dpadUpLongPressed(void);
BOOL dpadDownLongPressed(void);
BOOL dpadLeftLongPressed(void);
BOOL dpadRightLongPressed(void);
BOOL dpadEnterLongPressed(void);
BOOL topLeftLongPressed(void);
BOOL topRightLongPressed(void);

static void InitializeSystem(void);
void ProcessIO(void);
void UserInit(void);
void YourHighPriorityISRCode();
void YourLowPriorityISRCode();
